In [2]:
s = 'Hi there Sam'

In [3]:
s.split()

['Hi', 'there', 'Sam']

In [4]:
planet = 'Earth'
diameter = 12742
print ('The diameter of {0} is {1:.3f} kilometers'.format(planet, diameter))

The diameter of Earth is 12742.000 kilometers

In [5]:
email = 'user@domain.com'

In [6]:
email.split('@')[1]

'domain.com'

In [7]:
def dogFinder (var):
    return 'dog' in var.lower().split()

In [8]:
dogFinder ('Cats and Dog')

True

In [9]:
dogFinder ('Cows and Sheep')

False

In [10]:
def dogCounter (sent):
    count = 0
    for item in sent.lower().split():
        if item == 'dog':
            count += 1
    return count

In [11]:
dogCounter ('is there a dog here you call dog best dog ?')

3

In [12]:
seq = ['soup', 'dog', 'salad', 'cat', 'great']

In [13]:
seqFilter = list (filter (lambda x : x[0] == 's', seq))

In [14]:
seqFilter

['soup', 'salad']

In [15]:
#NUMPY!!!!!!!!!!!!!!!!!!

In [16]:
import numpy as np

In [17]:
my_list = [1,2,3]

In [18]:
arr = np.array(my_list)

In [19]:
arr

array([1, 2, 3])

In [20]:
my_mat = [[1,2,3],[4,5,6],[7,8,9]]

In [21]:
my_mat

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
np.array(my_mat)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [114]:
np.arange(0,10,2)

array([0, 2, 4, 6, 8])

In [115]:
np.arange(1,11)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [24]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [25]:
np.ones((2,3))

array([[1., 1., 1.],
       [1., 1., 1.]])

In [26]:
np.arange(0,5,1)

array([0, 1, 2, 3, 4])

In [116]:
np.linspace(0,5,50)

array([0.        , 0.10204082, 0.20408163, 0.30612245, 0.40816327,
       0.51020408, 0.6122449 , 0.71428571, 0.81632653, 0.91836735,
       1.02040816, 1.12244898, 1.2244898 , 1.32653061, 1.42857143,
       1.53061224, 1.63265306, 1.73469388, 1.83673469, 1.93877551,
       2.04081633, 2.14285714, 2.24489796, 2.34693878, 2.44897959,
       2.55102041, 2.65306122, 2.75510204, 2.85714286, 2.95918367,
       3.06122449, 3.16326531, 3.26530612, 3.36734694, 3.46938776,
       3.57142857, 3.67346939, 3.7755102 , 3.87755102, 3.97959184,
       4.08163265, 4.18367347, 4.28571429, 4.3877551 , 4.48979592,
       4.59183673, 4.69387755, 4.79591837, 4.89795918, 5.        ])

In [117]:
np.linspace (5,10,20)

array([ 5.        ,  5.26315789,  5.52631579,  5.78947368,  6.05263158,
        6.31578947,  6.57894737,  6.84210526,  7.10526316,  7.36842105,
        7.63157895,  7.89473684,  8.15789474,  8.42105263,  8.68421053,
        8.94736842,  9.21052632,  9.47368421,  9.73684211, 10.        ])

In [28]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [29]:
np.eye(8)

array([[1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1.]])

In [118]:
np.random.rand(5)

array([0.73702122, 0.31015614, 0.48263279, 0.84108412, 0.69187462])

In [120]:
np.random.rand (10)

array([0.96050886, 0.09967149, 0.40486093, 0.62944218, 0.68598828,
       0.55804509, 0.26454664, 0.53135496, 0.70001521, 0.87584302])

In [122]:
np.random.randn(3,3)

array([[-0.67366054,  0.74511799,  0.29376257],
       [ 1.34440668,  0.30065779, -1.23085731],
       [ 0.51334863,  0.87179046, -0.76662502]])

In [123]:
np.random.randn(2,5)

array([[ 0.66196653, -0.75160403,  0.69922204,  0.26467247, -1.45327059],
       [ 0.09546379, -0.3589196 ,  0.53446783,  1.06857014, -0.72241005]])

In [124]:
np.random.randint (40,60,7)

array([49, 57, 42, 42, 49, 49, 49])

In [32]:
np.random.randint(5,40,22)

array([26, 32,  8, 34, 19, 12, 38, 11, 37, 38, 18, 39, 17,  5, 38,  8, 23,
       29, 39, 37, 18,  7])

In [33]:
arr = np.arange(10,35)

In [34]:
arr

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
       27, 28, 29, 30, 31, 32, 33, 34])

In [35]:
ranarr = np.random.randint(0,50,10)

In [36]:
ranarr

array([44, 48, 31, 34, 18, 20,  5,  7, 12, 47])

In [37]:
arr.reshape(5,5)

array([[10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34]])

In [38]:
ranarr.max()

48

In [39]:
ranarr.min()

5

In [40]:
ranarr.argmax()

1

In [41]:
ranarr

array([44, 48, 31, 34, 18, 20,  5,  7, 12, 47])

In [125]:
ranarr.argmin()

6

In [126]:
ranarr.shape

(10,)

In [43]:
arr.shape

(25,)

In [44]:
arr = arr.reshape(5,5)

In [45]:
arr.shape

(5, 5)

In [46]:
arr.dtype

dtype('int32')

In [47]:
import numpy as np

In [48]:
arr = np.arange(0,11)

In [49]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [50]:
arr[3:9]

array([3, 4, 5, 6, 7, 8])

In [51]:
arr[:6]

array([0, 1, 2, 3, 4, 5])

In [52]:
 arr [0:5] = 100

In [53]:
arr

array([100, 100, 100, 100, 100,   5,   6,   7,   8,   9,  10])

In [54]:
arr = np.arange(0,11)

In [55]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [56]:
ses = np.arange (0,22)

In [57]:
ses

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21])

In [58]:
ses [7:]

array([ 7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21])

In [59]:
ses [9:21]

array([ 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20])

In [60]:
rar = np.random.randint (5,60,12)

In [61]:
rar

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [62]:
rar [4:7]

array([41, 59, 42])

In [63]:
rar [:]

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [64]:
newRar = rar [4:7]

In [65]:
newRar

array([41, 59, 42])

In [66]:
anotherRar = rar [3:8]

In [67]:
anotherRar

array([23, 41, 59, 42, 57])

In [68]:
rar

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [69]:
cut_rar = rar [3:6]

In [70]:
cut_rar

array([23, 41, 59])

In [71]:
cut_rar [:] = 47

In [72]:
cut_rar

array([47, 47, 47])

In [73]:
rar

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [74]:
rarcopy = rar.copy()

In [75]:
rarcopy

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [76]:
rarcopy [:] = 22

In [77]:
rarcopy

array([22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22])

In [78]:
rar

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [79]:
arr_2d = np.array([[3,5,7],[4,9,7],[8,1,3]])

In [80]:
arr_2d

array([[3, 5, 7],
       [4, 9, 7],
       [8, 1, 3]])

In [81]:
arr_2d [0,1]

5

In [82]:
arr_2d [1]

array([4, 9, 7])

In [83]:
arr_2d [:1]

array([[3, 5, 7]])

In [84]:
arr_2d [:,1]

array([5, 9, 1])

In [85]:
arr_2d [:,0]

array([3, 4, 8])

In [86]:
arr_2d [1:]

array([[4, 9, 7],
       [8, 1, 3]])

In [87]:
arr_2d [:2,1:]

array([[5, 7],
       [9, 7]])

In [88]:
arr_2d

array([[3, 5, 7],
       [4, 9, 7],
       [8, 1, 3]])

In [89]:
arr_2d [:, 1]

array([5, 9, 1])

In [90]:
arr_2d [1:,:2]

array([[4, 9],
       [8, 1]])

In [91]:
newMat = arr_2d[[0,0],[0,2]],[[2,0],[2,2]]

In [92]:
newMat

(array([3, 7]), [[2, 0], [2, 2]])

In [93]:
arr_2d [1:,1:]

array([[9, 7],
       [1, 3]])

In [94]:
arr_2d [:,:2:]

array([[3, 5],
       [4, 9],
       [8, 1]])

In [95]:
arr = np.arange(0,11)

In [96]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [97]:
boolarr = arr > 5

In [98]:
boolarr

array([False, False, False, False, False, False,  True,  True,  True,
        True,  True])

In [99]:
arr[boolarr]

array([ 6,  7,  8,  9, 10])

In [100]:
bool_arr = arr < 5

In [101]:
bool_arr

array([ True,  True,  True,  True,  True, False, False, False, False,
       False, False])

In [102]:
arr [bool_arr]

array([0, 1, 2, 3, 4])

In [103]:
arr [arr<3]

array([0, 1, 2])

In [106]:
 arr2d = np.arange (40).reshape(5,8)

In [107]:
arr2d

array([[ 0,  1,  2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29, 30, 31],
       [32, 33, 34, 35, 36, 37, 38, 39]])

In [108]:
arr2d [:3, 5:]

array([[ 5,  6,  7],
       [13, 14, 15],
       [21, 22, 23]])

In [112]:
newarr = arr2d [1:4,2:5]

In [111]:
arr2d.reshape(4,10)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39]])

In [113]:
arr2d [1:3,3:5]

array([[11, 12],
       [19, 20]])

In [127]:
#NUMPY OPERATIONS

In [128]:
"""
Array with array
Array with scalars
Universal Array functions
"""

'\nArray with array\nArray with scalars\nUniversal Array functions\n'

In [129]:
import numpy as soj

In [130]:
arr = soj.arange (0,11)

In [131]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [132]:
arr * 2

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [134]:
arr ** 2

array([  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int32)

In [135]:
arr * 100

array([   0,  100,  200,  300,  400,  500,  600,  700,  800,  900, 1000])

In [136]:
arr / 8

array([0.   , 0.125, 0.25 , 0.375, 0.5  , 0.625, 0.75 , 0.875, 1.   ,
       1.125, 1.25 ])

In [137]:
arr +6

array([ 6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [138]:
arr / arr

C:\Users\OWNER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [139]:
1 / arr

C:\Users\OWNER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in true_divide
  """Entry point for launching an IPython kernel.

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111,
       0.1       ])

In [140]:
arr1 = soj.arange (4,12)

In [141]:
arr2 = soj.arange (7,19)

In [144]:
arr1.reshape (4,2)

array([[ 4,  5],
       [ 6,  7],
       [ 8,  9],
       [10, 11]])

##

In [146]:
arr2.reshape (3,4)

array([[ 7,  8,  9, 10],
       [11, 12, 13, 14],
       [15, 16, 17, 18]])

In [147]:
arr1 + arr2

ValueError: operands could not be broadcast together with shapes (8,) (12,)

In [148]:
soj.sqrt(arr1)

array([2.        , 2.23606798, 2.44948974, 2.64575131, 2.82842712,
       3.        , 3.16227766, 3.31662479])

In [149]:
soj.exp (arr)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03, 2.20264658e+04])

In [150]:
soj.max(arr2)

18

In [151]:
soj.argmax(arr2)

11

In [152]:
arr2

array([ 7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18])

In [153]:
soj.cos(arr2)

array([ 0.75390225, -0.14550003, -0.91113026, -0.83907153,  0.0044257 ,
        0.84385396,  0.90744678,  0.13673722, -0.75968791, -0.95765948,
       -0.27516334,  0.66031671])

In [156]:
arr2.max()

18

In [158]:
soj.log(arr2)

array([1.94591015, 2.07944154, 2.19722458, 2.30258509, 2.39789527,
       2.48490665, 2.56494936, 2.63905733, 2.7080502 , 2.77258872,
       2.83321334, 2.89037176])

In [159]:
base = 4
height = 3

In [161]:
print ('The hypotenuse of the triangle is :',soj.hypot(base,height))

The hypotenuse of the triangle is : 5.0

In [162]:
weight = soj.random.randint(40,100,8)

In [163]:
weight

array([45, 48, 78, 54, 67, 89, 71, 77])

In [167]:
print ('The mean weight of the 8 students in the class is :',soj.mean(weight),'kg')

The mean weight of the 8 students in the class is : 66.125 kg

In [168]:
jack = soj.arange (2, 20, 4)
jill = soj.arange (3, 21, 4)

In [169]:
jack

array([ 2,  6, 10, 14, 18])

In [170]:
jill

array([ 3,  7, 11, 15, 19])

In [177]:
print ("the bitwise of two arrays:",soj.invert(jill))

the bitwise of two arrays: [ 2  6 10 14 18]

In [178]:
#NUMPY EXERCISES

In [179]:
import numpy as np

In [181]:
np.zeros (10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [184]:
arr = np.ones (10)

In [185]:
newarr = arr * 5

In [186]:
newarr

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

In [189]:
np.arange (10,51)

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
       27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
       44, 45, 46, 47, 48, 49, 50])

In [190]:
np.arange (10,51,2)

array([10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42,
       44, 46, 48, 50])

In [228]:
arr3x3 = np.random.randint (0,8,9).reshape(3,3)

In [229]:
arr3x3

array([[2, 2, 3],
       [5, 4, 3],
       [7, 1, 6]])

In [194]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [197]:
np.random.rand(1)

array([0.59169587])

In [198]:
stdarr = np.random.randn(25)

In [199]:
stdarr.reshape (5,5)

array([[ 1.21484566, -0.35340165,  1.68532932,  0.02434348, -0.14513546],
       [ 0.44206693,  2.00354316, -1.13983764, -0.12698935, -0.32694917],
       [-0.11233582,  0.73316336,  0.02805181, -0.98298717,  1.14823015],
       [-0.52141889, -0.17474657,  1.66840534, -0.75825418, -0.06039869],
       [ 1.50506277, -0.59660142, -0.62847265, -0.20897092, -0.66590203]])

In [231]:
np.arange (0.01,1.01,0.01).reshape (10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [233]:
np.linspace (0.01,1,100).reshape (10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [202]:
np.linspace(0,1,20)

array([0.        , 0.05263158, 0.10526316, 0.15789474, 0.21052632,
       0.26315789, 0.31578947, 0.36842105, 0.42105263, 0.47368421,
       0.52631579, 0.57894737, 0.63157895, 0.68421053, 0.73684211,
       0.78947368, 0.84210526, 0.89473684, 0.94736842, 1.        ])

In [203]:
vat = np.arange(1,26).reshape(5,5)
vat

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [235]:
vat[2:,:]

array([[11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [238]:
vat[2:,1:]

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

In [240]:
vat[3,4]

20

In [241]:
vat

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [242]:
vat[:3,1:2]

array([[ 2],
       [ 7],
       [12]])

In [244]:
vat [1:4,2:3]

array([[ 8],
       [13],
       [18]])

In [218]:
vat [4]

array([21, 22, 23, 24, 25])

In [220]:
vat [3:]

array([[16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [248]:
np.sum(vat, axis = 0, dtype = float)

array([55., 60., 65., 70., 75.])

In [226]:
np.std(vat)

7.211102550927978

In [245]:
vat.std()

7.211102550927978

In [249]:
#PANDAS !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

In [250]:
#SERIES

In [251]:
import numpy as np

In [252]:
import pandas as pd

In [253]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array (my_data)
d = {'a':10,'b':20,'c':30}

In [255]:
my_data

[10, 20, 30]

In [258]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [261]:
pd.Series(data = my_data, index = labels )

a    10
b    20
c    30
dtype: int64

In [262]:
pd.Series (arr)

0    10
1    20
2    30
dtype: int32

In [263]:
d

{'a': 10, 'b': 20, 'c': 30}

In [266]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [340]:
pd.Series ([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [343]:
pd.Series (['df','rt', 'gh'],['oo','pp','qq'])

oo    df
pp    rt
qq    gh
dtype: object

In [271]:
ser1 = pd.Series ([1,2,3,4],['USA','Germany','Japan','Russia'])

In [272]:
ser1

USA        1
Germany    2
Japan      3
Russia     4
dtype: int64

In [273]:
ser2 = pd.Series ([1,2,5,4],['USA','Germany','Italy','Russia'])

In [274]:
ser2

USA        1
Germany    2
Italy      5
Russia     4
dtype: int64

In [276]:
ser2['Italy']

5

In [278]:
ser3 = pd.Series (['USA','Germany','Italy','Russia'],[1,2,5,4])

In [279]:
ser3

1        USA
2    Germany
5      Italy
4     Russia
dtype: object

In [280]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      NaN
Russia     8.0
USA        2.0
dtype: float64

In [281]:
#DATAFRAMES

In [282]:
 from numpy.random import randn

In [344]:
np.random.seed(101)

In [347]:
fd = pd.DataFrame(randn(6,6),[1,2,3,4,5,6],['Black','Red','White','Yellow','Green','Blue'])

In [348]:
fd

      Black       Red     White    Yellow     Green      Blue
1 -0.116773  1.901755  0.238127  1.996652 -0.993263  0.196800
2 -1.136645  0.000366  1.025984 -0.156598 -0.031579  0.649826
3  2.154846 -0.610259 -0.755325 -0.346419  0.147027 -0.479448
4  0.558769  1.024810 -0.925874  1.862864 -1.133817  0.610478
5  0.386030  2.084019 -0.376519  0.230336  0.681209  1.035125
6 -0.031160  1.939932 -1.005187 -0.741790  0.187125 -0.732845

In [284]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [285]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [289]:
'''
Dataframe is just a bunch of series that share the same index;
WXYZ are individual series while ABCDE are indexes
'''

'\nDataframe is just a bunch of series that all share an index;\nWXYZ are individual series while ABCDE are indexes\n'

In [290]:
from numpy.random import randint

In [293]:
new_tab = pd.DataFrame (randn(4,3),['A','B','C','D'],['Apples','Oranges','Kiwis'])

In [294]:
new_tab

     Apples   Oranges     Kiwis
A  0.302665  1.693723 -1.706086
B -1.159119 -0.134841  0.390528
C  0.166905  0.184502  0.807706
D  0.072960  0.638787  0.329646

In [295]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [296]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [297]:
type(df['W'])

pandas.core.series.Series

In [298]:
type(df)

pandas.core.frame.DataFrame

In [299]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [307]:
df [['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [314]:
df['new'] = df['W'] + df['Y']

In [315]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [319]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [320]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [321]:
df.drop('new',axis = 1,inplace = True)

In [322]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [324]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [325]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [326]:
df.shape

(5, 4)

In [329]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [330]:
df.iloc [1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [335]:
new = pd.DataFrame(randn (3,2),['a','b','c'],['x','y'])

In [336]:
new

          x         y
a -0.497104 -0.754070
b -0.943406  0.484752
c -0.116773  1.901755

In [337]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [338]:
df.loc ['C','Y']

0.5288134940893595

In [377]:
df.loc [['C','E'],['X','Z']]

          X         Z
C  0.740122 -0.589001
E  1.978757  0.683509

In [378]:
#MORE DATAFRAME LECTURES:CONDITIONAL SELECTION

In [389]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [390]:
dfr = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [391]:
dfr

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [392]:
booldf = dfr > 0

In [393]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [394]:
dfr[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [395]:
dfr

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [396]:
dfr ['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [397]:
dfr ['Y'] == 0

A    False
B    False
C    False
D    False
E    False
Name: Y, dtype: bool

In [398]:
dfr [dfr ['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [399]:
dfr [dfr ['Y'] == 0]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [373]:
#grab all the rows in the dataframe where C < 0

In [374]:
dfr.loc ['C'] < 0

W    False
X    False
Y    False
Z    False
Name: C, dtype: bool

In [400]:
[dfr ['Z'] < 0]

[A    False
 B    False
 C     True
 D    False
 E    False
 Name: Z, dtype: bool]

In [409]:
resultdfr = dfr [dfr ['W'] > 0]

In [414]:
resultdfr ['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [417]:
dfr [dfr ['W'] > 0][['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [418]:
dfr [dfr ['W'] > 0][['Z','X','Y']]

          Z         X         Y
A  0.503826  0.628133  0.907969
B  0.605965 -0.319318 -0.848077
D  0.955057 -0.758872 -0.933237
E  0.683509  1.978757  2.605967

In [420]:
frac = dfr ['W'] > 0
newfrac = dfr[frac]
my_cols = ['Z','X','Y']
newfrac[my_cols]

          Z         X         Y
A  0.503826  0.628133  0.907969
B  0.605965 -0.319318 -0.848077
D  0.955057 -0.758872 -0.933237
E  0.683509  1.978757  2.605967

In [421]:
dfr [(dfr ['W'] > 0) & (dfr ['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [422]:
dfr [(dfr ['W'] > 0) | (dfr ['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [424]:
dfr.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [425]:
newind = 'CA NY WY OR CO'.split()

In [426]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [427]:
dfr_copy = dfr.copy()

In [428]:
dfr_copy

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [429]:
dfr_copy['States'] = newind

In [430]:
dfr_copy

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [434]:
dfr_copy.set_index('States', inplace = True)

In [436]:
dfr_copy

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [438]:
'''MULTIPLE CONDITIONAL SELECTION RECAP'''

'MULTIPLE CONDITIONAL SELECTION RECAP'

In [439]:
dfr_copy [(dfr_copy ['X']) > 0 & (dfr_copy ['Y'] < 0)]

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
WY     -2.018168  0.740122  0.528813 -0.589001
CO      0.190794  1.978757  2.605967  0.683509

In [441]:
dfr_copy [(dfr_copy['W'] < 0) | (dfr_copy ['Z'] > 0)]

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [446]:
additional_column = pd.Series (randn(5))

In [447]:
additional_column

0    0.390528
1    0.166905
2    0.184502
3    0.807706
4    0.072960
dtype: float64

In [448]:
dfr_copy ['A'] = additional_column

In [449]:
dfr_copy

               W         X         Y         Z   A
States
CA      2.706850  0.628133  0.907969  0.503826 NaN
NY      0.651118 -0.319318 -0.848077  0.605965 NaN
WY     -2.018168  0.740122  0.528813 -0.589001 NaN
OR      0.188695 -0.758872 -0.933237  0.955057 NaN
CO      0.190794  1.978757  2.605967  0.683509 NaN

In [442]:
#DATAFRAMES PART 3

In [450]:
#GROUP BY W/ PANDAS

In [451]:
import numpy as np
import pandas as pd

In [452]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanesssa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [453]:
df = pd.DataFrame(data)

In [454]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Vanesssa    124
4      FB      Carl    243
5      FB     Sarah    350

In [456]:
compgrp = df.groupby('Company')

In [457]:
compgrp

In [461]:
compgrp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [462]:
compgrp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [464]:
compgrp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [471]:
compgrp.mean().loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [472]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [473]:
df.groupby('Company').mean().loc['MSFT']

Sales    232.0
Name: MSFT, dtype: float64

In [481]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [488]:
#MERGING, JOINING AND CONCATENATING DATAFRAMES

In [490]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index = [0,1,2,3])

In [491]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index = [4,5,6,7])

In [496]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index = [8,9,10,11])

In [493]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [494]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [497]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [499]:
pd.concat ([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [500]:
pd.concat ([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [484]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [485]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [486]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [487]:
pd.merge(left,right,how = 'inner',on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [501]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                      'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [503]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [504]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [505]:
pd.merge (left, right, on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [506]:
pd.merge (left, right, how = 'inner', on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [507]:
pd.merge (left, right, how = 'outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [508]:
pd.merge (left, right, how = 'left', on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [509]:
pd.merge (left, right, how = 'right', on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [516]:
left = pd.DataFrame ({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                   index = ['K0','K1','K2'])

right = pd.DataFrame ({'C':['C0','C2','C3'],
                    'D':['D0','D2','D3']},
                    index = ['K0','K2','K3'])

In [517]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [518]:
 right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [519]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3